[{"title": "With Mars Methane Mystery Unsolved, Curiosity Serves Scientists a New One: Oxygen", "preview": "For the first time in the history of space exploration, scientists have measured the seasonal changes in the gases that fill the air directly above the surface of Gale Crater on Mars."}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance", "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan."}, {"title": "NASA Establishes Board to Initially Review Mars Sample Return Plans", "preview": "The board will assist with analysis of current plans and goals for one of the most difficult missions humanity has ever undertaken."}, {"title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "preview": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"title": "How NASA's Perseverance Mars Team Adjusted to Work in the Time of Coronavirus", "preview": "Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first."}, {"title": "NASA-JPL Names 'Rolling Stones Rock' on Mars", "preview": "NASA's Mars InSight mission honored one of the biggest bands of all time at Pasadena concert."}, {"title": "From JPL's Mailroom to Mars and Beyond", "preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"title": "NASA Engineers Checking InSight's Weather Sensors", "preview": "An electronics issue is suspected to be preventing the sensors from sharing their data about Mars weather with the spacecraft."}, {"title": "NASA Perseverance Mars Rover Scientists Train in the Nevada Desert", "preview": "Team members searched for signs of ancient microscopic life there, just as NASA's latest rover will on the Red Planet next year."}, {"title": "NASA's Mars 2020 Comes Full Circle", "preview": "Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL."}, {"title": "NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet", "preview": "The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021."}, {"title": "NASA Invites Students to Name Mars 2020 Rover", "preview": "Through Nov. 1, K-12 students in the U.S. are encouraged to enter an essay contest to name NASA's next Mars rover."}, {"title": "Mars Scientists Investigate Ancient Life in Australia", "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions."}, {"title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch", "preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."}]